/* mathar 1.1.0 */

var lessons = {
    1: 'الزوج المرتب',
	2: 'الضرب الديكارتى',
	3: 'العلاقة والدالة',
	4: 'كثيرات الحدود 1',
	5: 'كثيرات الحدود 2',
	6: 'النسبة والتناسب',
	7: 'خواص التناسب',
	8: 'التناسب المتسلسل',
	9: 'تغير ط/ع'
}

var dataset = [
	["","s title","title","عنوان","<form style=''><input name='title' value='عنوان رئيسى' type='text' placeholder='عنوان رئيسى' dir='auto'><label style='display:none;'>:العنوان</label></form>"],
	["", "dot_line", "dot_line", "سطر منقط", "<form style=''><input name='count' value='1' type='number' placeholder='1' dir='auto'><label style='display:none;'>:العدد</label></form>"],
	["", "L1P1", "L1P1", "", "", ""],
["", "L1P3", "L1P3", "", "", ""],
["", "s L1P4", "L1P4", "", "", ""],
["", "s L1P5", "L1P5", "", "", ""],
["", "L1P6", "L1P6", "", "", ""],
["", "s L1P7", "L1P7", "", "", ""],
["", "s L1P8", "L1P8", "", "", ""],
["", "s L1P9", "L1P9", "", "", ""],
["", "s L1P10", "L1P10", "", "", ""],
["", "s L1P11", "L1P11", "", "", ""],
["", "L1P12", "L1P12", "", "", ""],
["", "s L1P13", "L1P13", "", "", ""],
["", "L1P14", "L1P14", "", "", ""],
["", "L1P15", "L1P15", "", "", ""],
["", "s L1P16", "L1P16", "", "", ""],
["", "s L1P17", "L1P17", "", "", ""],
]

