
// static vars
const graph = 'رسم'
const solve_eq = "حل المعادلة"
const mcq = "<div data-tippy-content='اختيار من متعدد'>MCQ</div>" // multiple choice question.
const ftq = "<div data-tippy-content='سؤال مقالى'>FTQ</div>" // free text question.
const imag_nums = 'الأعداد المركبة'
const eq_factors = 'جذرى المعادلة'
const inequalities  = 'المتباينات'
const geometric = 'حساب مثلثات'
const similarity = 'التشابه'
const proportionality = 'التناسب'
//

var dataSet = [

    [
        "عنوان رئيسى", 
        "s title", 
        'title',
        "", 
        "", 
        "عنوان",  
        "<form><input name='title' value='عنوان رئيسى' type='text'><label>:العنوان</label></form>"
    ],
    ["إذا كان منحنى الدالة التربيعية د يقطع محور السينات فى النقطتين فإن مجموهة حل المعادة فى ح هى", 
        "h1_1_1", "m0_0_2_1", [0,0,18,2,1], solve_eq, mcq, ""],
    ["مجموعة حل المعادلة فى ح هى", 
        "h1_1_1", "m0_0_2_2", [0,0,18,2,2], solve_eq, mcq, ""],
    ["إذا كانت د(س)= أحد جذرى المعادلة: د(س)=0 فإن: د", 
        "h1_1_1", "m0_0_2_3", [0,0,18,2,3], solve_eq, mcq, ""],
    ["إذا كانت: جذرا للمعادلة فإن: م=", 
        "h1_1_1", "m0_0_2_4", [0,0,18,2,4], solve_eq, mcq, ""],
    ["إذا كان احد جذرى المعادلة هو فان  الجذر الاخر هو", 
        "h1_1_1", "m0_0_2_5", [0,0,18,2,5], solve_eq, mcq, ""],
    ["اوجد جبريا مجموعة حل كل من المعادلات الاتية فى ح:", 
        "m0_0_3", "m0_0_3", [0,0,18,3], solve_eq, ftq, ""],
    ["أوجد فى ℝ مجموعة حل كل من المعادلات الآتية بإستخدام القانون العام مقرباً الناتج لرقم عشرى وأحد:", 
        "m0_0_4", "m0_0_4", [0,0,19,4], solve_eq, ftq, ""],
    ["أوجد فى ℝ مجموعة حل كل من المعادلات الآتية جبرياً وحقق الناتج بيانياً:", 
        "s m0_0_5", "m0_0_5", [0,0,19,5], solve_eq, ftq, ""],
    ["إذا كان مجموعة الأعداد الصحيحة المتتالية (1+2+3+h(...)+N) تعطى بالعلاقة : G=f(N&2)(1+N) فكم عدداً متتالياً بدءاً من العدد 1 يكون مجموعها مساوياً :", 
        "m0_0_6", "m0_0_6", [0,0,19,6], solve_eq, ftq, ""],
    ["الشرط الذى يجعل المعادلة : Ap(x&2)+Bx+D=0 تربيعية هو", 
        "m0_0_7_1", "m0_0_7_1", [0,0,19,7,1], solve_eq, mcq, ""],
    ["إذا كان فان=", 
        "m0_0_7_2", "m0_0_7_2", [0,0,19,7,2], solve_eq, mcq, ""],
    ["إذا كان أحد جذرى المعادلة", 
        "m0_0_7_3", "m0_0_7_3", [0,0,19,7,3], solve_eq, mcq, ""],
    ["الجذر المشترك للمعادلتين التربيعيتين :  هو", 
        "m0_0_7_4", "m0_0_7_4", [0,0,19,7,4], solve_eq, mcq, ""],
    ["إذا كان المنحنى : فأى من العبارات التالية يكون صحيحاً؟", 
        "m0_0_7_5", "m0_0_7_5", [0,0,20,7,5], solve_eq, mcq, ""],
    ["الشكل المقابل يمثل المنحنى : y=Ap(x&2)+Bx+G", 
        "m0_0_7_6", "m0_0_7_6", [0,0,20,7,6], solve_eq, mcq, ""],
    ["إذا كان حجم متوازى المستطيلات = فإن  x=", 
        "m0_0_7_7", "m0_0_7_7", [0,0,20,7,7], solve_eq, mcq, ""],
    ["إذا كانت مساحة المستطيل =فإن محيط المستطيل =", 
        "m0_0_7_8", "m0_0_7_8", [0,0,20,7,8], solve_eq, mcq, ""],
    ["قطعة أرض على شكل مستطيل بعداه {eq} من الأمتار يراد مضاعفة مساحة هذه القطعة وذلك بزيادة كل بعد من بعديها بنفس المقدار فإن المقدار المضاف يساوى من  الأمتار.", 
        "m0_0_7_9", "m0_0_7_9", [0,0,20,7,9], solve_eq, mcq, ""],
    ["أوجد قيمة A التى تجعل x=2 أحد جذري المعادلة:", 
        "m0_0_8", "m0_0_8", [0,0,20,8], solve_eq, ftq, ""],
    ["أوجد قيم : A،B،G إذا علم جذرى المعادلة : D(x)=0 هما ", 
        "m0_0_9", "m0_0_9", [0,0,20,9], solve_eq, ftq, ""],
    ["ضع كلاً مما يأتى فى أبسط صورة :", 
        "m1_1_1", "m1_1_1", [0,0,29,1], imag_nums, ftq, ""],
    ["إذا كان N عدداً صحيحاً فاكتب كلاً مما يأتى فى أبسط صورة :", 
        "m1_1_2", "m1_1_2", [0,0,29,2], imag_nums, ftq, ""],
    ["إذا كان N عدداً صحيحاً فاكتب كلاً مما يأتى فى أبسط صورة :", 
        "m1_1_3", "m1_1_3", [0,0,29,3], imag_nums, ftq, ""],
    ["أوجد ناتج كل مما يأتى فى أبسط صورة :", 
        "m1_1_4", "m1_1_4", [0,0,29,4], imag_nums, ftq, ""],
    ["أوجد ناتج كل مما يأتى فى أبسط صورة :", 
        "m1_1_5", "m1_1_5", [0,0,29,5], imag_nums, ftq, ""],
    ["حل كلاً من المعادلات الآتية فى مجموعة الأعداد المركبة :", 
        "m1_1_6", "m1_1_6", [0,0,30,6], imag_nums, ftq, ""],
    ["حل كلاً من المعادلات الآتية فى مجموعة الأعداد المركبة :", 
        "m1_1_7", "m1_1_7", [0,0,30,7], imag_nums, ftq, ""],
    ["حل كلاً من المعادلات الآتية فى مجموعة الأعداد المركبة :", 
        "m1_1_8", "m1_1_8", [0,0,30,8], imag_nums, ftq, ""],
    ["إذا كان : فأثبت أن : x ، y مترافقان.", 
        "m1_1_9", "m1_1_9", [0,0,30,9], imag_nums, ftq, ""],
    ["إذا كان : فأثبت أن : p(A&2)+p(B&2)=1", 
        "m1_110", "m1_110", [0,0,30,10], imag_nums, ftq, ""],   
];
    
    